# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2021-07-25 17:22:32 krylon>
#
#+TAGS: optimize(o) refactor(r) bug(b) feature(f) architecture(a)
#+TAGS: web(w) database(d) javascript(j)
#+TODO: TODO(t) IMPLEMENT(i) TEST(e) RESEARCH(r) | DONE(d)
#+TODO: MEDITATE(m) PLANNING(p) REFINE(n) | FAILED(f) CANCELLED(c) SUSPENDED(s)
#+PRIORITIES: A G D

* DWD
  DWD is an application to fetch weather warnings from the Deutscher
  Wetterdienst and display them to the user in some way.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 20
   #+CAPTION: Clock summary at [2021-07-25 So 17:22]
   | Headline     | Time    |       |
   |--------------+---------+-------|
   | *Total time* | *14:44* |       |
   |--------------+---------+-------|
   | DWD          | 14:44   |       |
   | \_  Client   |         | 14:44 |
   #+END:
** Client
   :LOGBOOK:
   CLOCK: [2021-07-25 So 16:22]--[2021-07-25 So 17:22] =>  1:00
   CLOCK: [2021-07-24 Sa 19:14]--[2021-07-24 Sa 22:48] =>  3:34
   CLOCK: [2021-07-24 Sa 16:20]--[2021-07-24 Sa 18:23] =>  2:03
   CLOCK: [2021-07-24 Sa 09:55]--[2021-07-24 Sa 10:45] =>  0:50
   CLOCK: [2021-07-23 Fr 17:40]--[2021-07-24 Sa 00:57] =>  7:17
   :END:
   
** Database
   In the long term, I want to store weather warnings, even though I don't
   know yet what I would do with that information.
** User interface

